{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 24, "dim_ordering": "th", "bias": true, "activation": "linear", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "batch_input_shape": [null, 3, 66, 200], "nb_row": 5, "name": "Conv1", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "init": "glorot_uniform", "bias": true, "activation": "linear", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_row": 5, "name": "Conv2", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "init": "glorot_uniform", "bias": true, "activation": "linear", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_row": 5, "name": "Conv3", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "bias": true, "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_row": 3, "name": "Conv4", "trainable": true, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "bias": true, "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_row": 3, "name": "Conv5", "trainable": true, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC1", "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC2", "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 50}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC3", "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 10}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "output", "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 1}}]}