{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "th", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "input_dtype": "float32", "nb_col": 5, "b_constraint": null, "bias": true, "activation": "relu", "nb_row": 5, "batch_input_shape": [null, 3, 66, 200], "init": "glorot_uniform", "W_constraint": null, "name": "Conv1", "activity_regularizer": null, "nb_filter": 24, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "th", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "b_constraint": null, "bias": true, "activation": "relu", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "name": "Conv2", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "th", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "b_constraint": null, "bias": true, "activation": "relu", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "name": "Conv3", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "th", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "b_constraint": null, "bias": true, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "name": "Conv4", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "th", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "b_constraint": null, "bias": true, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "name": "Conv5", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.4}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 100, "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC2", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 50, "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC3", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 10, "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "FC4", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1, "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "output", "activation": "linear"}}]}